public/man/man1/chage.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - chage.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - chage.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>chage - change user password expiry information</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>chage</strong> [/options/] <em>LOGIN</em></p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>chage</strong> command changes the number of days between password changes
and the date of the last password change. This information is used by
the system to determine when a user must change their password.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The options which apply to the <strong>chage</strong> command are:</p>
<p>
<strong>-d</strong>, <strong>–lastday</strong> <em>LAST_DAY</em></p>
<blockquote>
<p>Set the number of days since January 1st, 1970 when the password was
last changed. The date may also be expressed in the format YYYY-MM-DD
(or the format more commonly used in your area). If the <em>LAST_DAY</em> is
set to <em>0</em> the user is forced to change his password on the next log on.</p>
</blockquote>
<p>
<strong>-E</strong>, <strong>–expiredate</strong> <em>EXPIRE_DATE</em></p>
<blockquote>
<p>Set the date or number of days since January 1, 1970 on which the users
account will no longer be accessible. The date may also be expressed in
the format YYYY-MM-DD (or the format more commonly used in your area). A
user whose account is locked must contact the system administrator
before being able to use the system again.</p>
<p>
For example the following can be used to set an account to expire in 180
days:</p>
<blockquote>
<pre class="example">
	    chage -E $(date -d +180days +%Y-%m-%d)
</pre>
</blockquote>
<p>
Passing the number <em>-1</em> as the <em>EXPIRE_DATE</em> will remove an account
expiration date.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help message and exit.</p>
</blockquote>
<p>
<strong>-i</strong>, <strong>–iso8601</strong></p>
<blockquote>
<p>When printing dates, use YYYY-MM-DD format.</p>
</blockquote>
<p>
<strong>-I</strong>, <strong>–inactive</strong> <em>INACTIVE</em></p>
<blockquote>
<p>Set the number of days of inactivity after a password has expired before
the account is locked. The <em>INACTIVE</em> option is the number of days of
inactivity. A user whose account is locked must contact the system
administrator before being able to use the system again.</p>
<p>
Passing the number <em>-1</em> as the <em>INACTIVE</em> will remove an accounts
inactivity.</p>
</blockquote>
<p>
<strong>-l</strong>, <strong>–list</strong></p>
<blockquote>
<p>Show account aging information.</p>
</blockquote>
<p>
<strong>-m</strong>, <strong>–mindays</strong> <em>MIN_DAYS</em></p>
<blockquote>
<p>Set the minimum number of days between password changes to <em>MIN_DAYS</em>. A
value of zero for this field indicates that the user may change their
password at any time.</p>
</blockquote>
<p>
<strong>-M</strong>, <strong>–maxdays</strong> <em>MAX_DAYS</em></p>
<blockquote>
<p>Set the maximum number of days during which a password is valid. When
<em>MAX_DAYS</em> plus <em>LAST_DAY</em> is less than the current day, the user will
be required to change their password before being able to use their
account. This occurrence can be planned for in advance by use of the
<strong>-W</strong> option, which provides the user with advance warning.</p>
<p>
Passing the number <em>-1</em> as <em>MAX_DAYS</em> will remove checking a passwords
validity.</p>
</blockquote>
<p>
<strong>-R</strong>, <strong>–root</strong> <em>CHROOT_DIR</em></p>
<blockquote>
<p>Apply changes in the <em>CHROOT_DIR</em> directory and use the configuration
files from the <em>CHROOT_DIR</em> directory. Only absolute paths are
supported.</p>
</blockquote>
<p>
<strong>-P</strong>, <strong>–prefix</strong> <em>PREFIX_DIR</em></p>
<blockquote>
<p>Apply changes to configuration files under the root filesystem found
under the directory <em>PREFIX_DIR</em>. This option does not chroot and is
intended for preparing a cross-compilation target. Some limitations: NIS
and LDAP users/groups are not verified. PAM authentication is using the
host files. No SELINUX support.</p>
</blockquote>
<p>
<strong>-W</strong>, <strong>–warndays</strong> <em>WARN_DAYS</em></p>
<blockquote>
<p>Set the number of days of warning before a password change is required.
The <em>WARN_DAYS</em> option is the number of days prior to the password
expiring that a user will be warned their password is about to expire.</p>
</blockquote>
<p>
If none of the options are selected, <strong>chage</strong> operates in an interactive
fashion, prompting the user with the current values for all of the
fields. Enter the new value to change the field, or leave the line blank
to use the current value. The current value is displayed between a pair
of <em>[ ]</em> marks.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
NOTE
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The <strong>chage</strong> program requires a shadow password file to be available.</p>
<p>
The chage program will report only the information from the shadow
password file. This implies that configuration from other sources (e.g.
LDAP or empty password hash field from the passwd file) that affect the
users login will not be shown in the chage output.</p>
<p>
The <strong>chage</strong> program will also not report any inconsistency between the
shadow and passwd files (e.g. missing x in the passwd file). The <strong>pwck</strong>
can be used to check for this kind of inconsistencies.</p>
<p>
The <strong>chage</strong> command is restricted to the root user, except for the <strong>-l</strong>
option, which may be used by an unprivileged user to determine when
their password or account is due to expire.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
CONFIGURATION
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The following configuration variables in /etc/login.defs change the
behavior of this tool:</p>
<p>
<strong>USE_TCB</strong> (boolean)</p>
<blockquote>
<p>If <em>yes</em>, the *tcb*(5) password shadowing scheme will be used.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
FILES
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>/etc/passwd</p>
<blockquote>
<p>User account information.</p>
</blockquote>
<p>
/etc/shadow</p>
<blockquote>
<p>Secure user account information.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
EXIT VALUES
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>The <strong>chage</strong> command exits with the following values:</p>
<p>
<em>0</em></p>
<blockquote>
<p>success</p>
</blockquote>
<p>
<em>1</em></p>
<blockquote>
<p>permission denied</p>
</blockquote>
<p>
<em>2</em></p>
<blockquote>
<p>invalid command syntax</p>
</blockquote>
<p>
<em>15</em></p>
<blockquote>
<p>cant find the shadow password file</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
SEE ALSO
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>*passwd*(5), *shadow*(5).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
